<a href="https://colab.research.google.com/github/yeonsikC/PYTHON/blob/master/pandas_practice2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
from google.colab import drive
drive.mount('/content/drive')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3Aietf%3Awg%3Aoauth%3A2.0%3Aoob&scope=email%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdocs.test%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdrive%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdrive.photos.readonly%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fpeopleapi.readonly&response_type=code

Enter your authorization code:
··········
Mounted at /content/drive

In [0]:
import pandas as pd
import numpy as np
import csv

# 24시간 강수 데이터

1.   필요한 변수만 데이터프레임 형식으로 저장.
2.   24시간 누적 강수 데이터를 기준으로, 24시간동안 비가 가장 많이 내린 지역과, 가장 적게 내린 지역을 나타낸다.

In [16]:
dataset = []
with open('/content/drive/My Drive/Colab Notebooks/datas/강우량+기상정보+(2017년+09월+10일+00_00+_+05_59).csv','r') as f:
  line = csv.reader(f)
  for row in line:
    dataset.append(row)
df = pd.DataFrame(dataset)
df.dtypes

0     object
1     object
2     object
3     object
4     object
5     object
6     object
7     object
8     object
9     object
10    object
11    object
12    object
13    object
14    object
dtype: object

In [17]:
df = pd.DataFrame(dataset[1:], columns = dataset[0])
df.head()

  ﻿"CHNL_ID" STN_ID          AWS_DTM SKY_CODE_ID  ... RNM_24HR      PA PS PTY_CD
0        KMA     92  2017-09-10 0:00              ...                   0      0
1        KMA     95  2017-09-10 0:00           0  ...    996.5  1014.5  0      0
2        KMA     96  2017-09-10 0:00           0  ...   1003.7  1014.7  0      0
3        KMA     98  2017-09-10 0:00           0  ...   1001.2  1014.3  0      0
4        KMA     99  2017-09-10 0:00           0  ...   1010.7  1014.1  0      0

[5 rows x 15 columns]

In [25]:
my = pd.DataFrame(df, columns=["STN_ID", "AWS_DTM", "RNM_24HR"])
my_clean = my[my.RNM_24HR.notnull()]
my_clean
my_clean.sort_values(by="RNM_24HR", ascending=False)

5

In [35]:
notnull = my_clean[my_clean.RNM_24HR!=""]
notnull.head()

  STN_ID          AWS_DTM RNM_24HR
1     95  2017-09-10 0:00    996.5
2     96  2017-09-10 0:00   1003.7
3     98  2017-09-10 0:00   1001.2
4     99  2017-09-10 0:00   1010.7
5    100  2017-09-10 0:00    928.2

In [49]:
rain = notnull.RNM_24HR
rain.head()

1     996.5
2    1003.7
3    1001.2
4    1010.7
5     928.2
Name: RNM_24HR, dtype: object

In [0]:
rain_f = pd.Series(rain, dtype=float)

In [51]:
rain_f.head()

1     996.5
2    1003.7
3    1001.2
4    1010.7
5     928.2
Name: RNM_24HR, dtype: float64

In [53]:
final_data = pd.DataFrame({"area":notnull.STN_ID, "date":notnull.AWS_DTM, "rain24":rain_f})
final_data.head()

  area             date  rain24
1   95  2017-09-10 0:00   996.5
2   96  2017-09-10 0:00  1003.7
3   98  2017-09-10 0:00  1001.2
4   99  2017-09-10 0:00  1010.7
5  100  2017-09-10 0:00   928.2

In [86]:
final_data.sort_values(by='rain24', ascending = False).head()

       area             date  rain24
369057  661  2017-09-10 9:17  1016.1
387621  661  2017-09-10 9:45  1016.0
366405  661  2017-09-10 9:13  1016.0
369720  661  2017-09-10 9:18  1016.0
371046  661  2017-09-10 9:20  1016.0

In [88]:
max_val = final_data.sort_values(by='rain24', ascending = False)
print("2017년 9월 10일의 24시간 누적 강수량 중 가장 많이 내린 지역ID와 그 기준시각은 아래와 같다.")
max_val[:1]

2017년 9월 10일의 24시간 누적 강수량 중 가장 많이 내린 지역과 그 기준시각은 아래와 같다.

       area             date  rain24
369057  661  2017-09-10 9:17  1016.1

In [70]:
final_data.sort_values(by='rain24').head()

       area              date  rain24
771151  189  2017-09-10 19:24   670.5
919062  314  2017-09-10 23:07   847.6
921051  314  2017-09-10 23:10   847.6
921714  314  2017-09-10 23:11   847.6
894531  314  2017-09-10 22:30   847.7

In [89]:
min_val = final_data.sort_values(by='rain24')
print("2017년 9월 10일의 24시간 누적 강수량 중 가장 적게 내린 지역ID와 그 기준시각은 아래와 같다.")
min_val[:1]

2017년 9월 10일의 24시간 누적 강수량 중 가장 적게 내린 지역ID와 그 기준시각은 아래와 같다.

       area              date  rain24
771151  189  2017-09-10 19:24   670.5